Tekla Open API Reference for Tekla Structures 2025
AngleList.ToString Method (IEnumerable<Angle>, String, IFormatProvider, Angle.UnitType)
 Converts the given angles to a string with the given parameters in the current unit
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string ToString(
	IEnumerable<Angle> angleList,
	string format,
	IFormatProvider formatProvider,
	Angle.UnitType angleUnit
)
Public Shared Function ToString (
	angleList As IEnumerable(Of Angle),
	format As String,
	formatProvider As IFormatProvider,
	angleUnit As Angle.UnitType
) As String
Parameters
angleList
Type: System.Collections.Generic.IEnumerable<Angle>
List of angles to convert
format
Type: System.String
The format string. Can be null.
formatProvider
Type: System.IFormatProvider
The number format provider.
angleUnit
Type: Tekla.Structures.Datatype.Angle.UnitType
The unit type.
Return Value
Type: String
The angle as a string
See Also
Reference
AngleList Class
ToString Overload
Tekla.Structures.Datatype Namespace